�
yC:\Users\natha\OneDrive\Skrivebord\Kea-it-arkitektur\5. semester\TravelBuddy\src\Modules\TravelBuddy.Users\UserService.cs
 ! +



 %



- 2



; C

 !

5 <

3 =

B H



 '



, 2

3 F

` g

p u
	{ �

# 3

( :

 
0 F "  - C
2 G% :P
    '$$! (//! (FF! (OO! (__! (kk! (~~! (

""! 2
"": ?&&< A
""H P))9 A
$$ && +2
&& '' ''  $))C G** !
)) ** 

--! .<
--B I11@ G44= D88 99 ;; #
// 11! /??  
11 22 
44 :: -
66 ??* 1AA 

DD@ J
DDO UHH) /JJ4 :
FF JJ '
HH II= H
II JJ< J

MM@ S
MMm tUU9 @XX= D
	MM} �QQ< A

MM� �YY5 ;
OO QQ +YY  (
QQ RR RR  $UUN R
UU VV 
XX YY= K

]]$ 4
]]9 ?``= C
__ `` +<
`` aa cc dd ee ff 

ii0 @
kk nn ,
nn ss 2
ss  !tt uu vv ww 

||5 G
~~   .
 
�� l

��" $
�� 
�� 
�� 
�� 
�� 
�� 
�� 
�� �
~C:\Users\natha\OneDrive\Skrivebord\Kea-it-arkitektur\5. semester\TravelBuddy\src\Modules\TravelBuddy.Users\Models\UserAudit.cs

 

 

 

		 

 



 

 

 

 

 ,

 �
yC:\Users\natha\OneDrive\Skrivebord\Kea-it-arkitektur\5. semester\TravelBuddy\src\Modules\TravelBuddy.Users\Models\User.cs

 

 

 

		 

 



 

 

 

* 4�
�C:\Users\natha\OneDrive\Skrivebord\Kea-it-arkitektur\5. semester\TravelBuddy\src\Modules\TravelBuddy.Users\IUserRepositoryFactory.cs

 +

 )�
}C:\Users\natha\OneDrive\Skrivebord\Kea-it-arkitektur\5. semester\TravelBuddy\src\Modules\TravelBuddy.Users\IUserRepository.cs

  



 



' ,

	 

 

/ :

? E

N Z



/ B



G M



V b

  

% +

 '

! 3�
�C:\Users\natha\OneDrive\Skrivebord\Kea-it-arkitektur\5. semester\TravelBuddy\src\Modules\TravelBuddy.Users\Infrastructure\PasswordHasher.cs

 &

 )
1 9

 "


  - 1
 5 ;

 )
1 9 "
B L "(
  0 5 $
    
 %%! -
 %% �	
�C:\Users\natha\OneDrive\Skrivebord\Kea-it-arkitektur\5. semester\TravelBuddy\src\Modules\TravelBuddy.Users\Infrastructure\Neo4j\Neo4jUserRepository.cs


  `


 $ ** ":: "VV tt &
�� 
�� "
�� "
' - ,
 'KK' 6
��' 6
��$ 3Z
0 6 1 7     !! !## $$ 
  "" !(
R T% '. 08 :
(( .SS  2
** 11 
11 22 22) /
22 33 

88 ,
884 9GG" '
:: JJ 
JJ KK KK7 =

NN d
NN$ (QQ SS dd ee ff gg #hh  ii  jj 

oo< G
ooL R{{& ,
oo[ gqq& 2{{. :
tt ~~  
~~  
�� %

�� 
�� 

��< O

��T Z
��& ,$

��c o
��& 2
��. :

�� -

��2 8
��" (

�� 
�� $

�� 
�� 
��7 =

��) 4

�� 
�� 

��. @�
�C:\Users\natha\OneDrive\Skrivebord\Kea-it-arkitektur\5. semester\TravelBuddy\src\Modules\TravelBuddy.Users\Infrastructure\MySql\UsersDbContext.cs
 #+ 9
; B		 



 $

$ .

 +2
9 E  33 WW +n
" (       !! $$ '' ** -- 
   
 ! "
 ! "
     ! "
!! !!! "
$$ $$! "
'' ''! "
** **! "
-- --! "�
33' -55 77 88 :: << == @@ AA DD GG JJ NN PP RR 
55 55  
88 88! "
:: ::! "
<< <<! "
== ==! "
@@ @@! "
AA AA! "
DD DD! "
GG GG! "
JJ JJ! "
NN NN! "
PP PP  
RR RR  
RR0 1RR5 6
SS  SS$ %
ZZ 'WW 

ZZ5 A�
�C:\Users\natha\OneDrive\Skrivebord\Kea-it-arkitektur\5. semester\TravelBuddy\src\Modules\TravelBuddy.Users\Infrastructure\MySql\MySqlUserRepository.cs


  n


$ ,     ''' %,, 55 ;; DD 
. 5 

 ,
4 9H M
8 9= >

 
$ ( 

< G
L Rb h
[ g& 2l x

 

$$< O
$$T Z''6 <
$$c o++  ,
'' )) ++ 

33 -
332 8662 8
66! "66& '

88) 4

BB. @�
�C:\Users\natha\OneDrive\Skrivebord\Kea-it-arkitektur\5. semester\TravelBuddy\src\Modules\TravelBuddy.Users\Infrastructure\MongoDb\MongoDbUserRepository.cs�


 !!* 6''6 B,,( 4AA' 3NN" .]]" .qq &
��& 2
��& 2
��& 2
�� )
�� )
��& 2
��" .T
 00 #BB) /FF  ]]A Gss 
��E K
��< B
 11 tt (
 22 !NNA Fuu 6
 "33# /vv 
��  ,
��  ,(
 "44  )550 9ww B
 77  )zz 
��  )
��< E
��A J
 88 {{ 

 &`
!!8 H'' @@ -PP ,__ , "
��# 3
�� &
�� -
##2 8&& !
&& '' '*
,, 'TT( 3cc( 3
�� *Z
,,5 800 11 22 33 "44 55, /77 88 
>>  2nn$ 6
@@ FF 
BB" #BB' (

LL! 0
LL8 =NNH M
NN QQ 
NN: ;NN? @
PP TT TT4 7

[[! 1
[[6 <]]I O
]] `` 
]]: ;]]? @
__ cc cc4 7

ii "n
ii( ,ll nn ss tt uu vv #ww  xx zz  {{ 
qq 2 5

��@ K

��P V
��M S

��_ k
��. :

�� 
��C I

��> ?
��C D

�� 
��K Q

�� 
�� 

�� 
�� $

�� 
�� 
��1 7

��@ S

��X ^
��D J

��g s
��. :

�� 
��6 <

��5 6
��: ;

��5 6
��: ;

�� 
��> D

�� 
�� 

��- 8

�� 
�� 

��: ;
��? @

�� 
�� 

��2 D�
zC:\Users\natha\OneDrive\Skrivebord\Kea-it-arkitektur\5. semester\TravelBuddy\src\Modules\TravelBuddy.Users\DTOs\UserDto.cs

 

 

 

 

		 �
C:\Users\natha\OneDrive\Skrivebord\Kea-it-arkitektur\5. semester\TravelBuddy\src\Modules\TravelBuddy.Users\DTOs\UserAuditDto.cs

 

 

 

 

 

 ChangePasswordRequestDto

		 



	 

 �
�C:\Users\natha\OneDrive\Skrivebord\Kea-it-arkitektur\5. semester\TravelBuddy\src\Modules\TravelBuddy.Users\DTOs\RegisterRequestDto.cs

 #

 



 

 

 !�
�C:\Users\natha\OneDrive\Skrivebord\Kea-it-arkitektur\5. semester\TravelBuddy\src\Modules\TravelBuddy.Users\DTOs\PasswordChangeRequestDto.cs

 )

 !



 !�
�C:\Users\natha\OneDrive\Skrivebord\Kea-it-arkitektur\5. semester\TravelBuddy\src\Modules\TravelBuddy.Users\DTOs\LoginRequestDto.cs

  

 



 �
�C:\Users\natha\OneDrive\Skrivebord\Kea-it-arkitektur\5. semester\TravelBuddy\src\Modules\TravelBuddy.Users\DTOs\AuthResponseDto.cs

 !

 

 